// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    alert("big array");
} else {
    alert("small array");
}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
let a = +prompt("A");
let b = +prompt("B");
let c = +prompt("C");
if (a > b && a > c) {
    alert("max a= " + a);
} else if (b > c && b > a) {
    alert("max b= " + b);
} else {
    alert("max c= " + c);
}
if ((a < b && a > c) || (a > b && a < c)) {
    alert("in the middle");
} else {
    alert("outside");
}

//  - Перепишіть конструкцію if з використанням умовного оператора '?'
let result = (a + b < 4) ? 'Мало' : 'Багато';
alert(result);

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
let g = -30;
let word = (g > 0) ? 'Plus' : (g === 0) ? 'Null' : 'Minus';
alert(word);